Documents/ESB/ESB_Consumer_0903/003TestSample/SAMPLE_XML_MUST/CardAuthorization/CD02_XbrdrWdlCardPswdRstRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CardAuthorization/XbrdrWdlCardPswdRstRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CardAuthorization</ServiceDomain>  
      <OperationName>XbrdrWdlCardPswdRst</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:XbrdrWdlCardPswdRstRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CD02</v11:TxnId>  
        <v11:TxnNo>CD0200001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>4020160418174010</v11:CardNo>  
        <v11:PinBlk>123456</v11:PinBlk> 
      </v11:ServiceBody> 
    </v11:XbrdrWdlCardPswdRstRq> 
  </soap:Body> 
</soap:Envelope>
